Klipper3d/klipper/lib/asf/sam/utils/cmsis/samg/samg55/include/samg55j19.h
/**
 * \file
 *
 * Copyright (c) 2014-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAMG55J19_
#define _SAMG55J19_

/** \addtogroup SAMG55J19_definitions SAMG55J19 definitions
  This file defines all structures and symbols for SAMG55J19:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAMG55J19 */
/* ************************************************************************** */
/** \addtogroup SAMG55J19_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M4 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M4 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M4 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M4 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M4 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M4 System Tick Interrupt       */
/******  SAMG55J19 specific Interrupt Numbers *********************************/

 SUPC_IRQn            =  0, /**<  0 SAMG55J19 Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 SAMG55J19 Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 SAMG55J19 Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 SAMG55J19 Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 SAMG55J19 Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 SAMG55J19 Power Management Controller (PMC) */
  EFC_IRQn             =  6, /**<  6 SAMG55J19 Enhanced Flash Controller (EFC) */
  FLEXCOM7_IRQn = 7, /**< 7 SAMG55J19 FLEXCOM 7 (FLEXCOM7) */
  FLEXCOM0_IRQn =  8, /**<  8 SAMG55J19 FLEXCOM 0 (FLEXCOM0) */
  FLEXCOM1_IRQn =  9, /**<  9 SAMG55J19 FLEXCOM 1 (FLEXCOM1) */
  PIOA_IRQn            = 11, /**< 11 SAMG55J19 Parallel I/O Controller A (PIOA) */
  PIOB_IRQn            = 12, /**< 12 SAMG55J19 Parallel I/O Controller B (PIOB) */
  PDMIC0_IRQn          = 13, /**< 13 SAMG55J19 PDM 0 (PDMIC0) */
  FLEXCOM2_IRQn = 14,  /**< 14 SAMG55J19 FLEXCOM2 (FLEXCOM2) */
  MEM2MEM_IRQn         = 15, /**< 15 SAMG55J19 MEM2MEM (MEM2MEM) */
  I2SC0_IRQn           = 16, /**< 16 SAMG55J19 I2SC0 (I2SC0) */
  I2SC1_IRQn           = 17, /**< 17 SAMG55J19 I2SC1 (I2SC1) */
  PDMIC1_IRQn          = 18, /**< 18 SAMG55J19 PDM 1 (PDMIC1) */
  FLEXCOM3_IRQn = 19, /**< 19 SAMG55J19 FLEXCOM3 (FLEXCOM3) */
  FLEXCOM4_IRQn = 20, /**< 20 SAMG55J19 FLEXCOM4 (FLEXCOM4) */
  FLEXCOM5_IRQn = 21, /**< 21 SAMG55J19 FLEXCOM5 (FLEXCOM5) */
  FLEXCOM6_IRQn = 22, /**< 22 SAMG55J19 FLEXCOM6 (FLEXCOM6) */
  TC0_IRQn             = 23, /**< 23 SAMG55J19 Timer/Counter 0 (TC0) */
  TC1_IRQn             = 24, /**< 24 SAMG55J19 Timer/Counter 1 (TC1) */
  TC2_IRQn             = 25, /**< 25 SAMG55J19 Timer/Counter 2 (TC2) */
  TC3_IRQn             = 26, /**< 26 SAMG55J19 Timer/Counter 3 (TC3) */
  TC4_IRQn             = 27, /**< 27 SAMG55J19 Timer/Counter 4 (TC4) */
  TC5_IRQn             = 28, /**< 28 SAMG55J19 Timer/Counter 5 (TC5) */
  ADC_IRQn             = 29, /**< 29 SAMG55J19 Analog To Digital Converter (ADC) */
  ARM_IRQn             = 30, /**< 30 SAMG55J19 FPU (ARM) */
  WKUP0_IRQn           = 31, /**< 31 SAMG55J19 External interrupt 0 (WKUP0) */
  WKUP1_IRQn           = 32, /**< 32 SAMG55J19 External interrupt 1 (WKUP1) */
  WKUP2_IRQn           = 33, /**< 33 SAMG55J19 External interrupt 2 (WKUP2) */
  WKUP3_IRQn           = 34, /**< 34 SAMG55J19 External interrupt 3 (WKUP3) */
  WKUP4_IRQn           = 35, /**< 35 SAMG55J19 External interrupt 4 (WKUP4) */
  WKUP5_IRQn           = 36, /**< 36 SAMG55J19 External interrupt 5 (WKUP5) */
  WKUP6_IRQn           = 37, /**< 37 SAMG55J19 External interrupt 6 (WKUP6) */
  WKUP7_IRQn           = 38, /**< 38 SAMG55J19 External interrupt 7 (WKUP7) */
  WKUP8_IRQn           = 39, /**< 39 SAMG55J19 External interrupt 8 (WKUP8) */
  WKUP9_IRQn           = 40, /**< 40 SAMG55J19 External interrupt 9 (WKUP9) */
  WKUP10_IRQn          = 41, /**< 41 SAMG55J19 External interrupt 10 (WKUP10) */
  WKUP11_IRQn          = 42, /**< 42 SAMG55J19 External interrupt 11 (WKUP11) */
  WKUP12_IRQn          = 43, /**< 43 SAMG55J19 External interrupt 12 (WKUP12) */
  WKUP13_IRQn          = 44, /**< 44 SAMG55J19 External interrupt 13 (WKUP13) */
  WKUP14_IRQn          = 45, /**< 45 SAMG55J19 External interrupt 14 (WKUP14) */
  WKUP15_IRQn          = 46, /**< 46 SAMG55J19 External interrupt 15 (WKUP15) */
  UHP_IRQn             = 47, /**< 47 SAMG55J19 USB OHCI (UHP) */
  UDP_IRQn             = 48, /**< 48 SAMG55J19 USB Device FS (UDP) */
  CRCCU_IRQn          = 49,  /**< 49 SAMG55G19 CRCCU */
  PERIPH_COUNT_IRQn    = 50  /**< Number of peripheral IDs */
} IRQn_Type;

